app/Cells/ArticleLatest.php

    public function render($category = null)
    {
        $model = new ArticleModel();

        if ($category) {
            $article = $model
                ->where("category", $category)
                ->orderBy("created_at", "DESC")
                ->limit(5)
                ->findAll();
        } else {
            $article = $model
                ->orderBy("created_at", "DESC")
                ->limit(5)
                ->findAll();
---
SELECT *
FROM `article`
ORDER BY `created_at` DESC
 LIMIT 5