app/Controllers/Article.php

SELECT *
FROM `article`
---
    public function admin_index()
    {
        $title = "Article Lists";
        $model = new ArticleModel();
        $article = $model->findAll();