app/Models/ArticleModel.php

    public function getCategories()
    {
        return $this->select('category')
            ->distinct()
            ->where('category IS NOT NULL')
            ->where('category !=', '')
            ->findAll();
---
SELECT DISTINCT `category`
FROM `article`
WHERE `category` IS NOT NULL
AND `category` != ''